{"count": 760, "ingredients": [{"comment": "10-oz pkg, organic", "ord": "1", "ingredient": "Spinach, frozen", "amount": "2", "measure": "Count"}, {"comment": "NIL", "ord": "2", "ingredient": "Oil", "amount": "1-2", "measure": "T."}, {"comment": "stems removed (may be omitted if your kids like it un-spicy.)", "ord": "3", "ingredient": "Dried Red Chilli Pods,", "amount": "3", "measure": "Count"}, {"comment": "(black or brown Mustard Seed)", "ord": "4", "ingredient": "Mohri", "amount": "1-1/2", "measure": "t."}, {"comment": "(Asafetida)", "ord": "5", "ingredient": "Hing", "amount": "1/8", "measure": "t."}, {"comment": "(Haldi)", "ord": "6", "ingredient": "Tumeric", "amount": "3/4", "measure": "t."}, {"comment": "(Caynne)", "ord": "7", "ingredient": "Chilli Powder", "amount": "1", "measure": "Pinch"}], "title": "Palak - Spinach", "direction_row_count": ["6"], "row_count": ["7"], "directions": [{"text": "Heat the oil in a pan on medium heat.  Make a Phodni: Add chillies, if desired.", "ord": "1"}, {"text": "Add Mustard Seed to the pan and heat until the seeds start to pop and some turn slightly gray.  Quickly take the pan off the burner.  Add the Asafetida and quickly stir.  Add the Turmeric and quickly stir.  (The idea is that the Mustard Seed should be toasty, but the Asafetida and Turmeric must not be burnt.)", "ord": "2"}, {"text": "Add the Frozen Spinach and a splash of water.  Return the pan to the burner.  Stir until the Spinach melts and fry it for a bit.  Add enough water to keep it from burning.", "ord": "3"}, {"text": "Bring it to a boil, and simmer for 5 minutes,  stirring as needed.  Serve.  Don't serve the whole chillies to the kids.", "ord": "4"}, {"text": "If your kids demand the authentic Indian Restaurant  Green Goo  version, remove any whole chillies and process the dish in the blender before serving.", "ord": "5"}, {"text": "For Palak Paneer, cut some paneer, or farmer cheese in 1/4 inch X 3/4 inchX1-1/2 inch pieces.  Lightly fry (in ghee if you have it) and cook it in the spinach for a few minutes.  You can buy paneer ready-made in the Indian Groceries, but it is very easy to make from organic milk.", "ord": "6"}]}