{"count": "14", "directions": [{"text": "Wash the dal and rice separately in water.  Add Methi to the Dal.  Soak in 2 separate vessels for 6 hours or more.  Filtered water, instead of chlorinated tap water, will probably allow fermentation to proceed faster.  We have not really experimented with this.", "ord": "1"}, {"text": "In the blender, grind the Udid Dal and Methi mixture until it is smooth and feels soft to the hand..", "ord": "2"}, {"text": "Grind the rice until it is not completely smooth.", "ord": "3"}, {"text": "Mix together the batters.  Allow to ferment, uncovered.  In India it may be fermented for as little as 8 hours.  In U.S. it will take 1-4 days.", "ord": "4"}, {"text": "After the batter has increased by 50 percent, add the salt to the batter, and mix, but only do this for the portion that you will use right away.", "ord": "5"}, {"text": "Spoon the batter into an oiled idli tin, or you can use any tin that steams inside a larger pan.  For really killer flavor, use ghee instead of oil.", "ord": "6"}, {"text": "Place the filled tin into a pot with boiling water on a high flame.  (Only steam, not water should touch batter.) Cover the pot and wait for the steam to build up.  Steam for10 minuutes.", "ord": "7"}, {"text": "Remove the tin from the steamer.  Allow idlis to cool for a few minutes, so that they will not stick so much and be easier to remove.", "ord": "8"}, {"text": "Remove idlis onto a plate and eat with sambar and chutney (or with jam).", "ord": "9"}, {"text": "If you are making more idlis immediately, you don't need to clean the tin, just re-oil it.", "ord": "10"}, {"text": "(You leave the batter uncovered, because this must not be a too hygenic process, otherwise no natural yeast from the air falls in.  Commercial yeast does not give a good result.  Some folks, including many restaurants, use baking powder for leavening, yielding a far inferior result.  The batter should be sour and slightly smelly from the yeast.  I think idlis taste better when the batter is really sour.)", "ord": "11"}, {"text": "You can store the batter in the refrigerator if you think it is sour enough.", "ord": "12"}, {"text": "Idlis store in the refrigerator quite well, also, they pack and travel quite well, even without refrigeration.", "ord": "13"}, {"text": "Rescuing your batter:  If your batter has not risen, or if it has risen an collapsed, you can add some commercial bread yeast along with some sugar for the yeast to feed on.", "ord": "14"}, {"text": "Rescuing your batter #2: If your batter has risen too much and it is very very sour, the sourness will not allow the yeast to grow.  In this case, simply add baking soda (not powder) to it just before you spoon it into the tins.  The baking soda will partially neutralize the acid and produce CO-2 gas.", "ord": "15"}], "ingredients": [{"amount": "2", "comment": "NIL", "ingredient": "Udid Dal", "ord": "1", "measure": "Cup"}, {"amount": "4", "comment": "white rice is traditional, and gives the same result, but brown is healthier.", "ingredient": "Brown Rice", "ord": "2", "measure": "Cup"}, {"amount": "2", "comment": "NIL", "ingredient": "Fenugreek (Methi)", "ord": "3", "measure": "t."}, {"amount": "3", "comment": "NIL", "ingredient": "Salt", "ord": "4", "measure": "t."}, {"amount": null, "comment": "NIL", "ingredient": "Oil or Ghee", "ord": "5", "measure": "t."}], "row_count": "15", "title": "Idli - South Indian steamed dumplings"}